wpmyj/STM32F10xUSBW/FWLIB/Lib/WOWLIB/SCR/STM32_GT32L32M0180.C
/******************************** User_library *********************************
* 文件名 	: STM32_GT32L32M0180.C
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2017/01/15
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_GT32L32M0180.H"

#define STM32_GT32L32M0180_Code_Edit

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
//static u32 CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
//static u32 CSD_Tab[4], CID_Tab[4], RCA = 0;
//static u32 DeviceMode = SD_DMA_MODE;
//static u32 TotalNumberOfBytes = 0, StopCondition = 0;
//u32 *SrcBuffer, *DestBuffer;
//volatile SD_Error TransferError = SD_OK;
//vu32 TransferEnd = 0;
//vu32 NumberOfBytes = 0;
//SDIO_InitTypeDef SDIO_InitStructure;
//SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
//SDIO_DataInitTypeDef SDIO_DataInitStructure;

/* Private function prototypes -----------------------------------------------*/
//static SD_Error CmdError(void);
//static SD_Error CmdResp1Error(u8 cmd);
//static SD_Error CmdResp7Error(void);
//static SD_Error CmdResp3Error(void);
//static SD_Error CmdResp2Error(void);
//static SD_Error CmdResp6Error(u8 cmd, u16 *prca);
//static SD_Error SDEnWideBus(FunctionalState NewState);
//static SD_Error IsCardProgramming(u8 *pstatus);
//static SD_Error FindSCR(u16 rca, u32 *pscr);
//static u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes);
//static void GPIO_Configuration(void);
//static void DMA_TxConfiguration(u32 *BufferSRC, u32 BufferSize);
//static void DMA_RxConfiguration(u32 *BufferDST, u32 BufferSize);

/* Private functions ---------------------------------------------------------*/


u8 BAR_PIC_ADDR[64]={0XFF};
u8	GBCode[64]={0XFF};

//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	SDCard_Configuration
//->功能描述		:	SD卡项目配置
//->输入			: 无
//->输出			:	Errorstatus	配置状态
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void	GT32L32_Configuration(void)
{
	//____________函数调用
	GT32L32_GPIO_Configuration();							//SPI管脚配置
	GT32L32_SPI_Configuration(GT32L32_CLK_SpeedH);	//SPI配置--低速
#ifdef	GT32L32_DMA
	GT32L32_DMA_Configuration((u32*)SD_TX_Addr,(u32*)SD_RX_Addr,SDCard_BufferSize);
#endif

}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	SDCard_Server
//->功能描述		:	SD卡项目执行(服务)程序
//->输入			: 
//->输出			:	Errorstatus	状态
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void	GT32L32_Server(void)
{

}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	SDCard_GPIO_Configuration
//->功能描述		:	SPI管脚配置
//->输入			: 
//->输出			:	无
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void GT32L32_GPIO_Configuration(void)
{
	//1)____________定义
	GPIO_InitTypeDef		GPIO_InitStructure;
	//2)____________开启时钟
		
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,	ENABLE);		//开启AFIO
	RCC_APB2PeriphClockCmd(GT32L32_CS_Periph,		ENABLE);		//开启CS时钟
	RCC_APB2PeriphClockCmd(GT32L32_CLK_Periph,	ENABLE);		//开启CLK时钟
	RCC_APB2PeriphClockCmd(GT32L32_MISO_Periph,	ENABLE);		//开启MISO时钟
	RCC_APB2PeriphClockCmd(GT32L32_MOSI_Periph,	ENABLE);		//开启MOSI时钟	
	//3)____________管脚配置
	//3.1）CS配置
	GPIO_InitStructure.GPIO_Pin			=	GT32L32_CS_PIN;
	GPIO_InitStructure.GPIO_Mode		=	GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed		= GPIO_Speed_50MHz;
	GPIO_Init(GT32L32_CS_PORT, &GPIO_InitStructure);
	//3.2）CLK配置
	GPIO_InitStructure.GPIO_Pin			=	GT32L32_CLK_PIN;
	GPIO_InitStructure.GPIO_Mode		=	GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed		= GPIO_Speed_50MHz;
	GPIO_Init(GT32L32_CLK_PORT, &GPIO_InitStructure);
	//3.3）MISO配置
	GPIO_InitStructure.GPIO_Pin			=	GT32L32_MISO_PIN;
	GPIO_InitStructure.GPIO_Mode		=	GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed		= GPIO_Speed_50MHz;
	GPIO_Init(GT32L32_MISO_PORT, &GPIO_InitStructure);
	//3.4）MOSI配置
	GPIO_InitStructure.GPIO_Pin			=	GT32L32_MOSI_PIN;
	GPIO_InitStructure.GPIO_Mode		=	GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed		= GPIO_Speed_50MHz;
	GPIO_Init(GT32L32_MOSI_PORT, &GPIO_InitStructure);
	
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	SDCard_SPI_Configuration
//->功能描述		:	SPI配置
//->输入			: Speed SPI速度选择（低速/高速)
//->输出			:	无
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void GT32L32_SPI_Configuration(char Speed)
{
	//1)____________定义
	SPI_InitTypeDef			SPI_InitStructure;
	RCC_APB2PeriphClockCmd(GT32L32_SPI_Periph,		ENABLE);		//开启SPI时钟
	//2)____________SPI初始化
	if(Speed==GT32L32_CLK_SpeedH)		//高速端口
	{
		SPI_InitStructure.SPI_Direction					=	SPI_Direction_2Lines_FullDuplex;	//设置方向				（2线全双工、2线只接收、一线发送、一线接收）
		SPI_InitStructure.SPI_Mode							=	SPI_Mode_Master;									//模式         	（从或主设备）
		SPI_InitStructure.SPI_DataSize					=	SPI_DataSize_8b;									//宽度         	（8或16位）
		SPI_InitStructure.SPI_CPOL							=	SPI_CPOL_High;										//时钟极性     	（低或高）
		SPI_InitStructure.SPI_CPHA							=	SPI_CPHA_2Edge;										//时钟相位     	（第一个或第二个跳变沿）
		SPI_InitStructure.SPI_NSS								=	SPI_NSS_Soft;											//片选方式     	（硬件或软件方式）
	//	SPI_InitStructure.SPI_NSS=SPI_NSS_Hard;																		//片选方式     	（硬件或软件方式）
		SPI_InitStructure.SPI_BaudRatePrescaler	=	SPI_BaudRatePrescaler_128;					//波特率预分频 	（从2---256分频）
		SPI_InitStructure.SPI_FirstBit					=	SPI_FirstBit_MSB;									//最先发送的位 	（最低位，还是最高位在先）
		SPI_InitStructure.SPI_CRCPolynomial			=	0X07;															//设置crc多项式	（其复位值为0x0007，根据应用可以设置其他数值。）
		SPI_Init(GT32L32_SPI_PORT,&SPI_InitStructure);													//SPI1初始化
	}
	else											//低速端口
	{
		SPI_InitStructure.SPI_Direction					=	SPI_Direction_2Lines_FullDuplex;	//设置方向				（2线全双工、2线只接收、一线发送、一线接收）
		SPI_InitStructure.SPI_Mode							=	SPI_Mode_Master;									//模式         	（从或主设备）
		SPI_InitStructure.SPI_DataSize					=	SPI_DataSize_8b;									//宽度         	（8或16位）
		SPI_InitStructure.SPI_CPOL							=	SPI_CPOL_High;										//时钟极性     	（低或高）
		SPI_InitStructure.SPI_CPHA							=	SPI_CPHA_2Edge;										//时钟相位     	（第一个或第二个跳变沿）
		SPI_InitStructure.SPI_NSS								=	SPI_NSS_Soft;											//片选方式     	（硬件或软件方式）
	//	SPI_InitStructure.SPI_NSS=SPI_NSS_Hard;																		//片选方式     	（硬件或软件方式）
		SPI_InitStructure.SPI_BaudRatePrescaler	=	SPI_BaudRatePrescaler_256;				//波特率预分频 	（从2---256分频）
		SPI_InitStructure.SPI_FirstBit					=	SPI_FirstBit_MSB;									//最先发送的位 	（最低位，还是最高位在先）
		SPI_InitStructure.SPI_CRCPolynomial			=	0X07;															//设置crc多项式	（其复位值为0x0007，根据应用可以设置其他数值。）
		SPI_Init(GT32L32_SPI_PORT,&SPI_InitStructure);													//SPI1初始化
	}
	GT32L32_CS_DisSelect;			//取消片选
	SPI_Cmd(GT32L32_SPI_PORT, ENABLE);				//使能SPI
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	SDCard_DMA_Configuration
//->功能描述		:	DMA配置
//->输入			: SD_TX_Addr	SPI发送地址
//							SD_RX_Addr	SPI接收地址
//							BufferSize	DMA缓存大小
//->输出			:	无
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void	GT32_DMA_Configuration(u32 *GT32L32_TX_Addr,u32 *GT32L32_RX_Addr,u32 BufferSize)
{
	//1)____________定义
	DMA_InitTypeDef			DMA_Initstructure;
	NVIC_InitTypeDef		NVIC_Initstructure;
	
	//2)____________DMA发送初始化，外设作为DMA的目的端
	DMA_Initstructure.DMA_PeripheralBaseAddr	=	(u32)(&SPI1->DR);								//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr			=	(u32)GT32L32_TX_Addr;								//DMA数据内存地址
	DMA_Initstructure.DMA_DIR									= DMA_DIR_PeripheralDST;					//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize					= BufferSize; 										//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc				= DMA_PeripheralInc_Disable;			//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc						=	DMA_MemoryInc_Enable;						//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize	= DMA_PeripheralDataSize_Byte;		//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize			= DMA_MemoryDataSize_Byte;				//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode								= DMA_Mode_Normal;								//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority						= DMA_Priority_High; 							//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M									= DMA_M2M_Disable;								//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMA1_Channel3,&DMA_Initstructure);																	//初始化DMA

	//3)____________DMA接收初始化，外设作为DMA的源端
	DMA_Initstructure.DMA_PeripheralBaseAddr	=	(u32)(&SPI1->DR);								//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr     	=	(u32)GT32L32_RX_Addr;								//DMA数据内存地址
	DMA_Initstructure.DMA_DIR									=	DMA_DIR_PeripheralSRC;					//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize					= BufferSize; 										//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc				= DMA_PeripheralInc_Disable;			//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc						=	DMA_MemoryInc_Enable;						//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize	= DMA_PeripheralDataSize_Byte;		//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize			= DMA_MemoryDataSize_Byte;				//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode								= DMA_Mode_Normal;								//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority						= DMA_Priority_High; 							//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M									= DMA_M2M_Disable;								//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMA1_Channel2,&DMA_Initstructure);																	//初始化DMA
	
	//4)____________DMA通道中断初始化---此为DMA发送中断----DMA发送完成中断
	NVIC_Initstructure.NVIC_IRQChannel = DMA1_Channel2_IRQChannel;       				//设置中断源
	NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority=1;
	NVIC_Initstructure.NVIC_IRQChannelSubPriority = 1; 													//中断响应优先级0	
	NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;        											//打开中断
	NVIC_Init(&NVIC_Initstructure);

	//5)____________设置触发中断事件
	//		DMA_IT_TC		传输完成中断
	//		DMA_IT_HT		传输过半中断
	//		DMA_IT_TE		传输错误中断
	DMA_ITConfig(DMA1_Channel2,DMA_IT_TC,ENABLE);						//传输完成中断屏蔽
	//6)____________使能DMA传输通道	
	SPI_I2S_DMACmd(GT32L32_SPI_PORT, SPI_I2S_DMAReq_Tx, ENABLE);				//使能DMA发送
	SPI_I2S_DMACmd(GT32L32_SPI_PORT, SPI_I2S_DMAReq_Rx, ENABLE);				//使能DMA接收

