wpmyj/STM32F10xUSBW/FWLIB/Lib/WOWLIB/SCR/STM32_GT32L32M0180.C
	//6)____________禁止DMA---需要传输时再打开
	DMA_Cmd(DMA1_Channel2,DISABLE);	
	DMA_Cmd(DMA1_Channel3,DISABLE);
}

/*****************************************************************************
点阵数字符号字符
说明：																					  --------------------
此部分内容为0 1 2 3 4 5 6 7 8 9 , . ￥ $ ￡
Squence：表示 字符顺序，从0开始计数。
BaseAdd：说明该套字库在芯片中的起始地址。
Address：对应字符点阵在芯片中的字节地址。
******************************************************************************/
u8  GT32L32_GetDig_Info(u8 Sequence,GT32L32_Info_TypeDef *GT32L32_Info)
{
	//____________定义变量
	u8 len=0;	//数据长度变量
	u32 address=0;				//地址变量
	u32 BaseAddr=GT32L32_Info->GT32L32_BaseAddr;	
	//____________配置数据
	switch(BaseAddr)
	{
	case 0x112400:	address=Sequence * 56+ BaseAddr;
									len=56;	//GT32L32_ReadBuffer(Sequence * 56+ BaseAdd,56,DZ_Data); //14X28
				break ;
	case 0x112748: 	address=Sequence * 120+ BaseAddr;
									len=120;//GT32L32_ReadBuffer(Sequence * 120+ BaseAdd,120,DZ_Data); //20X40
				break ;
	case 0x112CE8: 	address=Sequence * 114+ BaseAddr+2;
									len=112;//GT32L32_ReadBuffer(Sequence * 114+ BaseAdd+2,112,DZ_Data); //28X28
				break ;
	case 0x113396: 	address=Sequence * 202+ BaseAddr+2;
									len=200;//GT32L32_ReadBuffer(Sequence * 202+ BaseAdd+2,200,DZ_Data); //40X40
				break ;  
	default:       break ;
	}
	//____________更新数据
	GT32L32_Info->GT32L32_Address=address;
	GT32L32_Info->GT32L32_BufferSize=len;
	return 0;	  
}

/***************************************
ASCII 调用
ASCIICode：表示ASCII 码（8bits）
BaseAdd：说明该套字库在芯片中的起始地址。
GT32L32_ReadBuffer： 是读点阵数据函数。
GetBuffer：是保存读出的点阵数据的数组。
****************************************/
u8  GT32L32_GetASCII_Info(u8 ASCIICode,GT32L32_Info_TypeDef *GT32L32_Info)
{
	//____________定义变量
	u8 len=0;	//数据长度变量
	u32 address=0;				//地址变量
	u32 BaseAddr=GT32L32_Info->GT32L32_BaseAddr;
	
	//____________配置数据	
	if  ((ASCIICode >= 0x20)&&(ASCIICode<=0x7e))
	{	
	  switch(BaseAddr)
	  {
	  case 0x100000:	address=(ASCIICode-0x20)*8+BaseAddr;
										len=8;//GT32L32_ReadBuffer((ASCIICode-0x20)*8+BaseAdd,8,DZ_Data); //5X7
					break ;
	  case 0x100300:	address=(ASCIICode-0x20)*8+BaseAddr;
										len=8;//GT32L32_ReadBuffer((ASCIICode-0x20)*8+BaseAdd,8,DZ_Data); //7X8
					break ;
	  case 0x100600:	address=(ASCIICode-0x20)*8+BaseAddr;
										len=8;//GT32L32_ReadBuffer((ASCIICode-0x20)*8+BaseAdd,8,DZ_Data); //7X8 Fat
					break ;
	  case 0x100900:	address=(ASCIICode-0x20)*12+BaseAddr;
										len=12;//GT32L32_ReadBuffer((ASCIICode-0x20)*12+BaseAdd,12,DZ_Data); //6X12 
					break ;
	  case 0x100D80:	address=(ASCIICode-0x20)*16+BaseAddr;
										len=16;//GT32L32_ReadBuffer((ASCIICode-0x20)*16+BaseAdd,16,DZ_Data); //8X16
					break ;  
	  case 0x101580:	address=(ASCIICode-0x20)*16+BaseAddr;
										len=16;//GT32L32_ReadBuffer((ASCIICode-0x20)*16+BaseAdd,16,DZ_Data); // 8X16 Fat 
					break ;
	  case 0x101B80:	address=(ASCIICode-0x20)*48+BaseAddr;
										len=48;//GT32L32_ReadBuffer((ASCIICode-0x20)*48+BaseAdd,48,DZ_Data); //12X24
					break ;  
	  case 0x102D80: 	address=(ASCIICode-0x20)*64+BaseAddr;
										len=64;//GT32L32_ReadBuffer((ASCIICode-0x20)*64+BaseAdd,64,DZ_Data); //16X32
					break ;
	  case 0x104580: 	address=(ASCIICode-0x20)*64+BaseAddr;
										len=64;//GT32L32_ReadBuffer((ASCIICode-0x20)*64+BaseAdd,64,DZ_Data); //16X32 Fat
					break ;
	  case 0x105D80: 	address=(ASCIICode-0x20)*26+BaseAddr+2;
										len=24;//GT32L32_ReadBuffer((ASCIICode-0x20)*26+BaseAdd+2,24,DZ_Data); //12X12 A 
					break ;
	  case 0x106740: 	address=(ASCIICode-0x20)*34+BaseAddr+2;
										len=32;//GT32L32_ReadBuffer((ASCIICode-0x20)*34+BaseAdd+2,32,DZ_Data); //16X16 Arial
					break ; 
	  case 0x107400: 	address=(ASCIICode-0x20)*74+BaseAddr+2;
										len=72;//GT32L32_ReadBuffer((ASCIICode-0x20)*74+BaseAdd+2,72,DZ_Data); //24X24 
					break ;
	  case 0x108FC0: 	address=(ASCIICode-0x20)*130+BaseAddr+2;
										len=128;//GT32L32_ReadBuffer((ASCIICode-0x20)*130+BaseAdd+2,128,DZ_Data); //32X32 
					break ;
	  case 0x10C080: 	address=(ASCIICode-0x20)*26+BaseAddr+2;
										len=24;//GT32L32_ReadBuffer((ASCIICode-0x20)*26+BaseAdd+2,24,DZ_Data); //12X12 T 
					break ;
	  case 0x10CA50: 	address=(ASCIICode-0x20)*34+BaseAddr+2;
										len=32;//GT32L32_ReadBuffer((ASCIICode-0x20)*34+BaseAdd+2,32,DZ_Data); //16X16 T
					break ;
	  case 0x10D740: 	address=(ASCIICode-0x20)*74+BaseAddr+2;
										len=72;//GT32L32_ReadBuffer((ASCIICode-0x20)*74+BaseAdd+2,72,DZ_Data); //24X24 T 
					break ;
	  case 0x10F340: 	address=(ASCIICode-0x20)*130+BaseAddr+2;
										len=128;//GT32L32_ReadBuffer((ASCIICode-0x20)*130+BaseAdd+2,128,DZ_Data); //32X32 T 
					break ;  
	  default: 
					break ;
	  }
		//____________更新数据
		GT32L32_Info->GT32L32_Address=address;			//字符地址
		GT32L32_Info->GT32L32_BufferSize=len;				//点阵数据长度
	 return 1;
	}
	else
	{
		GT32L32_Info->GT32L32_Address=address;								//字符地址
		GT32L32_Info->GT32L32_BufferSize=len;									//点阵数据长度
		GT32L32_Info->GT32L32_Error=GT32L32_Error_ASCIICode;	//ASCII码错误
		return 0; 
	}
}
/*************************************************************************************************** 
16x16点阵GB18030汉字&字符
函数：u8 GB18030_16_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址,读取点阵数据到指定数组。 
参数：c1,c2,c3,c4：
4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2 传入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x114FDE;
 “啊”字的内码为0xb0a1,则byte address = GB18030_16_GetData(0xb0,0xa1,0x00,0x00) *32+BaseAdd; 
word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = GB18030_16_GetData(0x81,0x39,0xee,0x39) *32+ BaseAdd
word address = byte address / 2 
****************************************************************************************************/
u8 GT32L32_GetGB18030_Info(u16 word,GT32L32_Info_TypeDef *GT32L32_Info) 
{
	//____________定义变量
	u8	len=0;	//数据长度变量
	u32 address=0;				//地址变量
	u32 BaseAddr=GT32L32_Info->GT32L32_BaseAddr;
	
	u8	c1=word>>8;
	u8	c2=word;
	u8	c3=0;
	u8	c4=0;
	u8	l1=0;
	//____________字体判断
	switch(BaseAddr)
	{
		case	GB18030_BaseAddr_zf12x12	:	l1=0;len=24;
					break;
		case	GB18030_BaseAddr_zf16x16	:	l1=0;len=32;
					break;
		case	GB18030_BaseAddr_zf24x24	:	l1=0;len=72;
					break;
		case	GB18030_BaseAddr_zf32x32	:	l1=192;len=128;
					break;
		default: 
					break ;
	}
	//____________数据检查
	if(c2==0x7F) 	//空
	{
		GT32L32_Info->GT32L32_Error=GT32L32_Error_HzEmp;	//汉字内码低8位为0x7F,为空内容
		return 0;
	}
	//0）____________配置数据		
	if(c1>=0xA1 && c1 <= 0xa9 && c2>=0xa1) //Section 1 
		address= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f)
			c2--; 
		address=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
		address= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038-l1; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40 ) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--;
		address=(c1-0x81)*190 + (c2-0x40) + 1038 +6768-l1;
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f) 
			c2--; 
		address=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848-l1; 
	}
	else if(c1==0x81 && c2>=0x39) //四字节区1 
	{ 
		address =1038 + 21008+(c3-0xEE)*10+c4-0x39-l1; 
	} 
	else if(c1==0x82)//四字节区2 
	{ 
		address =1038 + 21008+161+(c2-0x30)*1260+(c3-0x81)*10+c4-0x30-l1; 
	}
	//____________更新数据
	address=address*len+BaseAddr;
	GT32L32_Info->GT32L32_Address=address;			//字符地址
	GT32L32_Info->GT32L32_BufferSize=len;				//点阵数据长度	
	
	return	1; 
}

/*************************************************************************************************** 
16x16点阵GB18030汉字&字符
函数：u8 GB18030_16_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址,读取点阵数据到指定数组。 
参数：c1,c2,c3,c4：
4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2 传入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x114FDE;
 “啊”字的内码为0xb0a1,则byte address = GB18030_16_GetData(0xb0,0xa1,0x00,0x00) *32+BaseAdd; 
word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = GB18030_16_GetData(0x81,0x39,0xee,0x39) *32+ BaseAdd
word address = byte address / 2 
****************************************************************************************************/
u8 GT32L32_Get_Info(u16 word,GT32L32_Info_TypeDef *GT32L32_Info) 
{ 
	//____________定义变量
	u8 len=0;	//数据长度变量
	u32 address=0;				//地址变量
	u32 GT32L32_BaseAddress=GT32L32_Info->GT32L32_BaseAddr;
	//0）____________基地址判断
	if((GT32L32_BaseAddress<ASCII_BaseAddr_zf5x7)||(GT32L32_BaseAddress>=Reserved_BaseAddr_LSB))
	{
		GT32L32_Info->GT32L32_Error=GT32L32_Error_Addr;
		return 0;
	}
	//1）____________获取数字地址&点阵字符长度信息
	else if(GT32L32_BaseAddress==Digital_BaseAddr_sz14x28||GT32L32_BaseAddress==Digital_BaseAddr_sz20x40||GT32L32_BaseAddress==Digital_BaseAddr_sz28||GT32L32_BaseAddress==Digital_BaseAddr_sz40)
	{
		GT32L32_GetDig_Info(word&0xFF,GT32L32_Info);
		return 1;
	}
	//2）____________获取ASCII字符地址&点阵字符长度信息
	else if(GT32L32_BaseAddress<=ASCII_BaseAddr_TNR32)
	{
		GT32L32_GetASCII_Info(word&0xFF,GT32L32_Info);
		return 1;
	}
	//3）____________获取字符地址&点阵字符长度信息
	else if(GT32L32_BaseAddress==GB18030_BaseAddr_hz12x12||GT32L32_BaseAddress==GB18030_BaseAddr_hz16x16||GT32L32_BaseAddress==GB18030_BaseAddr_hz24x24||GT32L32_BaseAddress==GB18030_BaseAddr_hz32x32)
	{
		GT32L32_GetGB18030_Info(word,GT32L32_Info);
	}
	//4）获取条码地址
	//5）获取天线符号地址
	//6）获取电池符号地址
//	u32 BaseAdd=0x194FDE; 
	
//	return(Address*32+BaseAddr);
		return 0;
}
/*************************************************************************************************** 
16x16点阵GB18030汉字&字符
函数：u8 GB18030_16_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址,读取点阵数据到指定数组。 
参数：c1,c2,c3,c4：
4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2 传入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x114FDE;
 “啊”字的内码为0xb0a1,则byte address = GB18030_16_GetData(0xb0,0xa1,0x00,0x00) *32+BaseAdd; 
word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = GB18030_16_GetData(0x81,0x39,0xee,0x39) *32+ BaseAdd
word address = byte address / 2 
****************************************************************************************************/
u32 GT32L32_GetBufferLen(u16 word,GT32L32_BaseAddr_TypeDef *BaseAddr,u8 c1, u8 c2, u8 c3, u8 c4) 
{ 
	u32 len=0;
	u32 Address=0;
//	u32 BaseAdd=0x194FDE; 
	if(c2==0x7f) 
	{
		return (0);
	} 
	if(c1>=0xA1 && c1 <= 0xa9 && c2>=0xa1) //Section 1 
		Address= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f)
			c2--; 
		Address=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
		Address= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40 ) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--;
		Address=(c1-0x81)*190 + (c2-0x40) + 1038 +6768;
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f) 
			c2--; 
		Address=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848; 
	}
	else if(c1==0x81 && c2>=0x39) //四字节区1 
	{ 
		Address =1038 + 21008+(c3-0xEE)*10+c4-0x39; 
	} 
	else if(c1==0x82)//四字节区2 
	{ 
		Address =1038 + 21008+161+(c2-0x30)*1260+(c3-0x81)*10+c4-0x30; 
	} 
//	GT32L32_ReadBuffer(Address*32+BaseAddr,32,GetBuffer);
	return(Address*32+*BaseAddr); 
}
/*************************************************************************************************** 
12x12点阵GB18030汉字&字符
函数：u32 GB18030_12_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址，读取点阵数据到指定数组。 
参数：汉字内码通过参数c1,c2传入，c3=0;c4=0. 
注：12x12为GBK字符集，无四字节区。 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x093D0E，
“啊”字的内码为0xb0a1,则byte address = GB18030_12_GetData(0xb0,0xa1,0x00,0x00) *24+BaseAdd ,
word address = byte address / 2	.
****************************************************************************************************/
#ifdef	STM32_GT32L32M0180_Code_Edit
u32 GT32L32_GetGB18030_12(u8 c1, u8 c2, u8 c3, u8 c4,u8 *GetBuffer) 
{
	u32 h=0;
	u32 BaseAdd=0x113D0E; 
	
