wpmyj/STM32F10xUSBW/FWLIB/Lib/WOWLIB/SCR/STM32_GT32L32M0180.C
	return 0;
}

#else

u32 GT32L32_GetGB18030_12(u8 c1, u8 c2, u8 c3, u8 c4,u8 *GetBuffer) 
{
	u32 h=0;
	u32 BaseAdd=0x113D0E; 
	if(c2==0x7f) 
	{
		GT32L32_ReadBuffer(BaseAdd,24,GetBuffer);
		return (BaseAdd);
	} 
	if(c1>=0xA1 && c1 <= 0xa9 && c2>=0xa1) //Section 1 
		h= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f)
			c2--; 
		h=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
			h= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40 ) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--;
		h=(c1-0x81)*190 + (c2-0x40) + 1038 +6768;
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f) 
			c2--; 
		h=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848; 
	} 
	GT32L32_ReadBuffer(h*24+BaseAdd,24,GetBuffer);
	return(h*24+BaseAdd); 
}
#endif
/*************************************************************************************************** 
16x16点阵GB18030汉字&字符
函数：u8 GB18030_16_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址,读取点阵数据到指定数组。 
参数：c1,c2,c3,c4：
4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2 传入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x114FDE;
 “啊”字的内码为0xb0a1,则byte address = GB18030_16_GetData(0xb0,0xa1,0x00,0x00) *32+BaseAdd; 
word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = GB18030_16_GetData(0x81,0x39,0xee,0x39) *32+ BaseAdd
word address = byte address / 2 
****************************************************************************************************/
u32 GT32L32_GetGB18030_16(u8 c1, u8 c2, u8 c3, u8 c4,u8 *GetBuffer) 
{ 
	u32 h=0;
	u32 BaseAdd=0x194FDE; 
	if(c2==0x7f) 
	{
		GT32L32_ReadBuffer(BaseAdd,32,GetBuffer);
		return (BaseAdd);
	} 
	if(c1>=0xA1 && c1 <= 0xa9 && c2>=0xa1) //Section 1 
		h= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f)
			c2--; 
		h=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
		h= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40 ) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--;
		h=(c1-0x81)*190 + (c2-0x40) + 1038 +6768;
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f) 
			c2--; 
		h=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848; 
	}
	else if(c1==0x81 && c2>=0x39) //四字节区1 
	{ 
		h =1038 + 21008+(c3-0xEE)*10+c4-0x39; 
	} 
	else if(c1==0x82)//四字节区2 
	{ 
		h =1038 + 21008+161+(c2-0x30)*1260+(c3-0x81)*10+c4-0x30; 
	} 
	GT32L32_ReadBuffer(h*32+BaseAdd,32,GetBuffer);
	return(h*32+BaseAdd); 
}

/*************************************************************************************************** 
24x24点阵GB18030汉字&字符
函数：u8 GB18030_24_GetData(u8 c1, u8 c2, u8 c3, u8 c4) 
功能：计算汉字点阵在芯片中的地址,读取点阵数据到指定数组。 
参数：c1,c2,c3,c4：
4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2 传入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。
如果用户是按 word mode 读取点阵数据，则其地址(word address)为字节地址除以2，
即：word address = byte address / 2 . 例如：
BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x1F43DE;
 “啊”字的内码为0xb0a1,则byte address = GB18030_24_GetData(0xb0,0xa1,0x00,0x00) *72+BaseAdd; 
word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = GB18030_24_GetData(0x81,0x39,0xee,0x39) *72+ BaseAdd
word address = byte address / 2 
****************************************************************************************************/
u32 GT32L32_GetGB18030_24(u8 c1, u8 c2, u8 c3, u8 c4,u8 *GetBuffer) 
{ 
	u32 h=0;
	u32 BaseAdd=0x2743DE; 
	if(c2==0x7f) 
	{
		GT32L32_ReadBuffer(BaseAdd,72,GetBuffer);
		return (BaseAdd);
	} 
	if(c1>=0xA1 && c1 <= 0xa9 && c2>=0xa1) //Section 1 
		h= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f) c2--; 
		h=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
		h= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40 ) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--;
		h=(c1-0x81)*190 + (c2-0x40) + 1038 +6768;
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f) 
			c2--; 
		h=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848; 
	}
	else if(c1==0x81 && c2>=0x39) //四字节区1 
	{ 
		h =1038 + 21008+(c3-0xEE)*10+c4-0x39; 
	} 
	else if(c1==0x82)//四字节区2 
	{ 
		h =1038 + 21008+161+(c2-0x30)*1260+(c3-0x81)*10+c4-0x30; 
	} 
	GT32L32_ReadBuffer(h*72+BaseAdd,72,GetBuffer);
	return(h*72+BaseAdd); 
}

/*************************************************************************************************** 
32x32点阵GB18030汉字&字符
函数：u32 GB18030_32_GetData (u8 c1, u8 c2, u8 c3, u8 c4)  
功能：计算汉字点阵在芯片中的地址 
参数：c1,c2,c3,c4：4字节汉字内码通过参数c1,c2,c3,c4传入，双字节内码通过参数c1,c2传 入，c3=0,c4=0 
返回：汉字点阵的字节地址(byte address)。如果用户是按 word mode 读取点阵数据，
则其地 址(word address)为字节地址除以2，即：word address = byte address / 2 . 
例如：BaseAdd: 说明汉字点阵数据在字库芯片中的起始地址，即BaseAdd＝0x47AE10; “啊”字的内码为0xb0a1,
则byte address = gt(0xb0,0xa1,0x00,0x00) *128+BaseAdd word address = byte address / 2 
“.”字的内码为0x8139ee39,则byte address = gt(0x81, 0x39,0xee,0x39) *128+ BaseAdd word address = byte address / 2 
****************************************************************************************************/
u32 GT32L32_GetGB18030_32(u8 c1, u8 c2, u8 c3, u8 c4,u8 *GetBuffer) 
{ 
	u32 h=0;
	u32  BaseAdd=0x47AE10;
	if(c2==0x7f) 
	{
		GT32L32_ReadBuffer(BaseAdd,128,GetBuffer);
		return (BaseAdd); 
	}
	if(c1>=0xA1 && c1 <= 0xAB && c2>=0xa1) //Section 1 
		h= (c1 - 0xA1) * 94 + (c2 - 0xA1); 
	else if(c1>=0xa8 && c1 <= 0xa9 && c2<0xa1) //Section 5 
	{ 
		if(c2>0x7f) 
			c2--; 
		h=(c1-0xa8)*96 + (c2-0x40)+846; 
	} 
	if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1) //Section 2 
		h= (c1 - 0xB0) * 94 + (c2 - 0xA1)+1038-192; 
	else if(c1<0xa1 && c1>=0x81 && c2>=0x40) //Section 3 
	{ 
		if(c2>0x7f) 
			c2--; 
		h=(c1-0x81)*190 + (c2-0x40) + 1038 +6768-192; 
	} 
	else if(c1>=0xaa && c2<0xa1) //Section 4 
	{ 
		if(c2>0x7f)
			c2--;
		h=(c1-0xaa)*96 + (c2-0x40) + 1038 +12848-192; 
	} 
	else if(c1==0x81 && c2>=0x39) //四字节区1 
	{ 
		h =1038 + 21008+(c3-0xEE)*10+c4-0x39-192; 
	} 
	else if(c1==0x82)//四字节区2 
	{ 
		h =1038 + 21008+161+(c2-0x30)*1260+(c3-0x81)*10+c4-0x30-192; 
	} 
	GT32L32_ReadBuffer(h*128+BaseAdd,128,GetBuffer);
	return(h*128+BaseAdd);  
} 

/**********************************************************************
EAN13条形码调用程序
函数：DWORD* BAR_CODE(int* BAR_NUM)
功能：将数组条形码转为对应条形码图形地址。
参数：int* BAR_NUM 条形码数字数组指针，BAR_NUM[13]数组包含13个数字。
返回：定义DWORD BAR_PIC_ADDR[13];用于存放对应地址，返回此数组指针。
***********************************************************************/

