wpmyj/STM32F10xUSBW/FWLIB/Lib/WOWLIB/SCR/STM32_GT32L32M0180.C
u32 GT32L32_GetBarCode_13(u8 * BAR_NUM)
{
	u32 i,BaseAddr=0x478FD2;
	BAR_PIC_ADDR[0]=BAR_NUM[0]*54+540*0+ BaseAddr;
	BAR_PIC_ADDR[1]=BAR_NUM[1]*54+540*1+ BaseAddr;
	switch(BAR_NUM[0])
	{
		case 0:
			for(i=2;i<=6;i++)
			{
				BAR_PIC_ADDR[i]=BAR_NUM[i]*54+540*1+ BaseAddr;
			}
		break;
		case 1:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*2+ BaseAddr;
		break;
		case 2:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*2+ BaseAddr;
		break;
		case 3:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*1+ BaseAddr;
		break;
		case 4:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*2+ BaseAddr;
		break;
		case 5:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*2+ BaseAddr;
		break;
		case 6:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*1+ BaseAddr;
		break;
		case 7:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*2+ BaseAddr;
		break;
		case 8:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*1+ BaseAddr;
		break;
		case 9:
			BAR_PIC_ADDR[2]=BAR_NUM[2]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[3]=BAR_NUM[3]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[4]=BAR_NUM[4]*54+540*1+ BaseAddr;
			BAR_PIC_ADDR[5]=BAR_NUM[5]*54+540*2+ BaseAddr;
			BAR_PIC_ADDR[6]=BAR_NUM[6]*54+540*1+ BaseAddr;
		break;
	}
	BAR_PIC_ADDR[7]=BAR_NUM[7]*54+540*3+ BaseAddr;
	for(i=8;i<=11;i++)
	{
		BAR_PIC_ADDR[i]=BAR_NUM[i]*54+540*4+ BaseAddr;
	}
	BAR_PIC_ADDR[12]=BAR_NUM[12]*54+540*5+ BaseAddr;
	
	memcpy(BAR_NUM,BAR_PIC_ADDR,140);	
	return BAR_PIC_ADDR[0];
}

/***********************************************************************************************
GB/T 18347-2001(CODE128)条形码调用程序
函数：u32 BAR_CODE128(u8 *BAR_NUM)
功能：将数组条形码转为对应条形码图形地址
参数：u8 *BAR_NUM 条形码数字数组指针,BAR_NUM[4]数组包含4个条形码ASCII符(数组取值为0~94)。
返回：定义u32 BAR_PIC_ADDR[7] ；用于存放对应地址，返回数组指针。
设基地址：BaseAddr=0x3F2ED3;
起始符有3种模式
当flag=1时为Code-128-A;
当flag=2时为Code-128-B;
当flag=3时为Code-128-C;
***********************************************************************************************/
u32 GT32L32_GetBarCode_128(u8	*BAR_NUM,u8	flag)
{
  u32 BaseAddr=0x479C7A;
  u8 i;
  for(i=0;i<7;i++) 
	{
     switch(flag)
		{  
		case 1 :
			 if(i==0)
			 {
				 BAR_PIC_ADDR[i]=103*40+BaseAddr;
			 }
			 else if(i==1||i==2||i==3||i==4)           
			 {
				 BAR_PIC_ADDR[i]=BAR_NUM[i-1]*40+BaseAddr;
			 }
			 else if(i==5)
			 {
				 BAR_PIC_ADDR[i]=95*40+BaseAddr;
			 }
			 else if(i==6)
			 {
				 BAR_PIC_ADDR[i]=106*40+BaseAddr;
			 }
			 break;
     
		case 2 :
			if(i==0)
			{
				BAR_PIC_ADDR[i]=104*40+BaseAddr;
			}
			else if(i==1||i==2||i==3||i==4)           
			{
				BAR_PIC_ADDR[i]=BAR_NUM[i-1]*40+BaseAddr;
			}
			else if(i==5)
			{
				BAR_PIC_ADDR[i]=95*40+BaseAddr;
			}
			else if(i==6)
			{
				BAR_PIC_ADDR[i]=106*40+BaseAddr;
			}
			break;
   	       
		case 3 :
			if(i==0)
			{
				BAR_PIC_ADDR[i]=105*40+BaseAddr;
			}
			else if(i==1||i==2||i==3||i==4)           
			{
				BAR_PIC_ADDR[i]=BAR_NUM[i-1]*40+BaseAddr;
			}
			else if(i==5)
			{
				BAR_PIC_ADDR[i]=95*40+BaseAddr;
			}
			else if(i==6)
			{
				BAR_PIC_ADDR[i]=106*40+BaseAddr;
			}
			break;
   
     default:
     break;
		}
	}
	return BAR_PIC_ADDR[0];
}

/***********************************
天线调用程序
函数：u32 Antenna_CODE_12X12_GetData(u8 NUM)
功能：获取12X12天线调用地址,取出点阵数据。
参数：NUM 0123带表天线信号强度。
返回：数据地址
***********************************/
u32 GT32L32_GetAntennaCode_12X12(u8	NUM,u8 *GetBuffer)
{
	u32 Address,BaseAdd=0x47AD32;
	Address=NUM*24+BaseAdd;
	GT32L32_ReadBuffer(Address,24,GetBuffer);
	return Address;
}

/**********************************
电池调用程序
函数：u32 Battery_CODE_12X12_GetData(u8 NUM)
功能：获取12X12电池调用地址,取出点阵数据。
参数：NUM 0123带表电池电量。
返回：数据地址
**********************************/
u32 GT32L32_GetBatteryCode_12X12(u8	NUM,u8 *GetBuffer)
{
	u32 Address, BaseAdd=0x47ADAA;
	Address=BaseAdd+NUM*24;
	GT32L32_ReadBuffer(Address,24,GetBuffer);
	return Address;
}
/**********************************************************
UNICODE转GBK码表映射算法,仅1&3字符区 
函数：WORD U2G(WORD Unicode) 
功能：将UNICODE码转换为GB码,
注：仅应用于1区&3区。 
参数：WORD Unicode,表示输入的UNICODE码。 
返回：对应的GB码在字库中存放的地址。
（注:读取对应地址2字节数据即为unicode对应的GB码）。
***********************************************************/ 

u16 GT32L32_U2G_13(u16 Unicode) 
{
	u16 GB_Code; 
	u32 i; 
	u16 UG[]={	0x3000,0x3001,0x3002,0x00b7,0x02c9,0x02c7,0x00a8,
							0x3003,0x3005,0x2014, 0xff5e,0x2016,0x2026,0x2018,0x2019,0x201c,
							0x201d,0x3014,0x3015,0x3008, 0x3009,0x300a,0x300b,0x300c,0x300d,
							0x300e,0x300f,0x3016,0x3017,0x3010, 0x3011,0x00b1,0x00d7,0x00f7,
							0x2236,0x2227,0x2228,0x2211,0x220f,0x222a, 0x2229,0x2208,0x2237,
							0x221a,0x22a5,0x2225,0x2220,0x2312,0x2299,0x222b, 0x222e,0x2261,
							0x224c,0x2248,0x223d,0x221d,0x2260,0x226e,0x226f,0x2264, 0x2265,
							0x221e,0x2235,0x2234,0x2642,0x2640,0x00b0,0x2032,0x2033,0x2103,
							0xff04,0x00a4,0xffe0,0xffe1,0x2030,0x00a7,0x2116,0x2606,0x2605,
							0x25cb, 0x25cf,0x25ce,0x25c7,0x25c6,0x25a1,0x25a0,0x25b3,0x25b2,
							0x203b,0x2192, 0x2190,0x2191,0x2193,0x3013
						}; 

	if(Unicode<=0xffe5&&Unicode>=0xff01)//section 3 
	{ 
		if(Unicode==0xff04) 
			GB_Code=0xa1e7;
		if(Unicode==0xff5e) 
			GB_Code=0xa1ab; 
		if(Unicode==0xffe0) 
			GB_Code=0xa1e9; 
		if(Unicode==0xffe1) 
			GB_Code=0xa1ea; 
		if(Unicode==0xffe3) 
			GB_Code=0xa3fe; 
		if(Unicode==0xffe5) 
			GB_Code=0xa3a4; 
		else
			GB_Code=Unicode-0xff01+0xa3a1; 
	} 
	if(Unicode<=0x3013) 
	{ 
		for(i=0;i<94;i++) 
		{ 
			if(Unicode==UG[i]) 
			GB_Code=0xa1a1+i; 
		} 
	}
	GBCode[0]=GB_Code>>8;
	GBCode[1]=GB_Code&0xff;
	return GB_Code;
}

/***************************************************************************
UNICODE转GBK码表映射算法（不含符号区,转换全部双字节区）
GB_Address转换之后的GB码的存放地址， 
函数：u32 U2G(u16 Unicode) 
功能：将UNICODE码转换为GB码, 
参数：u16 Unicode,表示输入的UNICODE码。 
返回：对应的GB码在字库中存放的地址。 
（注:读取对应地址2字节数据即为unicode对应的GB码）。
转码表起始地址： BaseAdd＝0x3EA90E;
***************************************************************************/
u32 GT32L32_UNICODE_To_GBK(u16 unicode,u8 *GetBuffer)
{
	u32 BaseAdd=0x46A90E;
	u32 Address,U_Start_Addr;
	if(unicode<=0x0451&&unicode>=0x00a0) 
	{
		U_Start_Addr	=	0;
		Address= U_Start_Addr +(unicode-0x00a0)*2; 
	} 
	else if(unicode<=0x2642&&unicode>=0x2010) 
	{ 
		U_Start_Addr =1892; 
		Address= U_Start_Addr +(unicode-0x2010)*2; 
	} 
	else if(unicode<=0x33d5&&unicode>=0x3000) 
	{ 
		U_Start_Addr =5066; 
		Address= U_Start_Addr +(unicode-0x3000)*2; 
	} 
	else if(unicode<=0x9fa5&&unicode>=0x4e00) 
	{ 
		U_Start_Addr =7030; 
		Address= U_Start_Addr +(unicode-0x4e00)*2; 
	} 
	else if(unicode<=0xfe6b&&unicode>=0xfe30) 
	{ 
		U_Start_Addr =48834; 
		Address= U_Start_Addr +(unicode-0xfe30)*2; 
	} 
	else if(unicode<=0xff5e&&unicode>=0xff01) 
	{ 
		U_Start_Addr =48954; 
		Address= U_Start_Addr +(unicode-0xff01)*2; 
	} 
	else if(unicode<=0xffe5&&unicode>=0xffe0) 
	{ 
		U_Start_Addr =49142; 
		Address= U_Start_Addr +(unicode-0xffe0)*2; 
	} 
	else if (unicode<=0xFA29&&unicode>=0xF92C) 
	{ 
		U_Start_Addr =49312; 
		Address= U_Start_Addr +(unicode-0xF92C)*2; 
	} 
	else if(unicode<=0xE864&&unicode>=0xE816) 
	{ 
		U_Start_Addr =49820; 
		Address= U_Start_Addr +(unicode-0xE816)*2; 
	}
	else if(unicode<=0x2ECA&&unicode>=0x2E81) 
	{ 
		U_Start_Addr =49978; 
		Address= U_Start_Addr +(unicode-0x2E81)*2; 
	} 
	else if(unicode<=0x49B7&&unicode>=0x4947) 
	{ 
		U_Start_Addr =50126; 
		Address= U_Start_Addr +(unicode-0x4947)*2; 
	} 
	else if(unicode<=0x4DAE&&unicode>=0x4C77) 
	{ 
		U_Start_Addr =50352; 
		Address= U_Start_Addr +(unicode-0x4C77)*2; 
	} 
	else if(unicode<=0x3CE0&&unicode>=0x3447) 
	{ 
		U_Start_Addr =50976; 
		Address= U_Start_Addr +(unicode-0x3447)*2; 
	} 
	else if(unicode<=0x478D&&unicode>=0x4056) 
	{ 
		U_Start_Addr =55380; 
		Address= U_Start_Addr +(unicode-0x4056)*2; 
	} 
	Address+=BaseAdd;
	GT32L32_ReadBuffer(Address,2,GetBuffer);
	return Address; 
}



/***********************************************************
BIG5转GBK转换算法
函数：u32 GT32L32_BIG5_To_GBK(u16 BIG5_Code) 
功能：计算BIG5码对应GB码存放的起始地址 
参数：BIG5_Code 输入BIG5编码双字节 
返回：对应GB码存放地址，对应GB码高位在前，低位在后。
************************************************************/
u32 GT32L32_BIG5_To_GBK(u16 BIG5_Code,u8 *GetBuffer) 
{
	u32 Address,part_addr,BaseAddr=0x7F1E10;//转码表基地址; 
	u8 TMP,BIG5_MSB,BIG5_LSB; 
	BIG5_MSB= BIG5_Code >>8; 
	BIG5_LSB= BIG5_Code &0x00ff; 

	if(BIG5_MSB>=0xa1&&BIG5_MSB<=0xa3)
	{ 
		part_addr=0; 
		TMP=0xa1; 
	} 
	else if(BIG5_MSB>=0xa4&&BIG5_MSB<=0xc6) 
	{ 
		part_addr=816; 
		TMP=0xa4; 
	} 
	else if(BIG5_MSB>=0xc9&&BIG5_MSB<=0xf9) 
	{ 
		part_addr=11618; TMP=0xc9; 
	}
	if(BIG5_LSB<=0x7e&&BIG5_LSB>=0x40) 
	{ 
		Address=part_addr+((BIG5_MSB-TMP)*157+BIG5_LSB-0x40)*2+BaseAddr; 
	}
	else if(BIG5_LSB<=0xfe&&BIG5_LSB>=0xa1) 
	{ 
		Address=part_addr+((BIG5_MSB-TMP)*157+BIG5_LSB-0xa1+63)*2+BaseAddr; 
	}
	GT32L32_ReadBuffer(Address,2,GetBuffer);
	
	return Address; 
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	GT32L32_ReadStatus
//->功能描述		:	读取芯片状态
//->输入			: Address  	：	表示字符点阵在芯片中的字节地址。
//->						len				：	是读点阵数据字节数。
//->						*Buffer		：	是保存读出的点阵数据的数组。
//->输出			:	读出的字节
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
u8 GT32L32_ReadStatus(void)
{
#ifdef	GT32L32_SPIPORT_EN
	//____________定义变量
	u8	ChipStatus=0;
	u8	Address=0x05;	//0X60 OR 0XC7
	//____________使能片选
	GPIO_ResetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_Select;
	//____________发送地址数据	
	GT32L32_ReadWriteByte(Address);						//发送地址
	//____________接收数据	
	
