wpmyj/STM32F10xUSBW/FWLIB/Lib/WOWLIB/SCR/STM32_GT32L32M0180.C
	ChipStatus=GT32L32_ReadWriteByte(0XFF);// 从字库读出点阵数据到数组中。

	//____________取消片选	
	GPIO_SetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_DisSelect;

#else
	//____________定义变量
	u8	ChipStatus=0;
	u8	Address=0x05;	//0X60 OR 0XC7
	//____________使能片选
	GT32L32_CS_Select;
	//____________发送地址数据	
	GT32L32_SendByte(Address);
	//____________接收数据	
	ChipStatus=GT32L32_ReadByte();	// 从字库读出点阵数据到数组中。
	//____________取消片选
	GT32L32_CS_DisSelect;
#endif
	return ChipStatus;
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	r_dat_bat
//->功能描述		:	从字库中读数据函数
//->输入			: Address  	：	表示字符点阵在芯片中的字节地址。
//->						len				：	是读点阵数据字节数。
//->						*Buffer		：	是保存读出的点阵数据的数组。
//->输出			:	读出的字节
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void GT32L32_ChipErase(void)
{
#ifdef	GT32L32_SPIPORT_EN
	//____________定义变量
	u32 i=0;
	u8	len=255;
	u8	Address=0x60;	//0X60 OR 0XC7
	//____________使能片选
	GPIO_ResetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_Select;

	GT32L32_ReadWriteByte(Address);						//发送地址

	for(i=0;i<len;i++)
	{
	 GT32L32_ReadWriteByte(0XFF);// 从字库读出点阵数据到数组中。
	}
	//____________取消片选	
	GPIO_SetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_DisSelect;

#else
	//____________定义变量
	u32	j=0;
	u8	len=255;
	u8	Address=0x60;	//0X60 OR 0XC7
	//____________使能片选
	GT32L32_CS_Select;
	//____________发送地址数据	
	GT32L32_SendByte(Address);
	//____________接收数据	
	for(j=0;j<len;j++)
	{
	 GT32L32_ReadByte();	// 从字库读出点阵数据到数组中。
	}
	//____________取消片选
	GT32L32_CS_DisSelect;

#endif
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	r_dat_bat
//->功能描述		:	从字库中读数据函数
//->输入			: Address  	：	表示字符点阵在芯片中的字节地址。
//->						len				：	是读点阵数据字节数。
//->						*Buffer		：	是保存读出的点阵数据的数组。
//->输出			:	读出的字节
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
u8 GT32L32_ReadBuffer(u32 Address,u16 len,u8 *Buffer)
{
#ifdef	GT32L32_SPIPORT_EN
	//____________定义变量
	u32 i=0;
//	u8	Status=0XFF;
	//____________使能片选
	GPIO_ResetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_Select;
	Address=Address|0x03000000;//0x03指令字+地址。
//	Address=Address|0x0B000000;//0x0B指令字+地址。--快速
	GT32L32_ReadWriteByte(Address>>24);				//发送地址高8位
	GT32L32_ReadWriteByte(Address>>16);				//发送地址
	GT32L32_ReadWriteByte(Address>>8);				//发送地址
	GT32L32_ReadWriteByte(Address);						//发送地址
	if((Address&0x0B000000)==0x0B000000)
		GT32L32_ReadWriteByte(0XFF);							//从字库读出点阵数据到数组中。
//	while((Status=GT32L32_ReadStatus()&0x01)!=0x01);
	i=0x0F;
	while(i--);
	for(i=0;i<len;i++)
	{
	 Buffer[i]=GT32L32_ReadWriteByte(0XFF);// 从字库读出点阵数据到数组中。
	}
	//____________取消片选	
	GPIO_SetBits(GPIOC,GPIO_Pin_6);
	GT32L32_CS_DisSelect;
	return Buffer[0];	
#else
	//____________定义变量
	u32	j=0;
	//____________使能片选
	GT32L32_CS_Select;
	Address=Address|0x03000000;//0x03指令字+地址。
//	Address=Address|0x0B000000;//0x0B指令字+地址。--快速
	//____________发送地址数据	
	GT32L32_SendByte((Address>>24)	&	0xFF);
	GT32L32_SendByte((Address>>16)	&	0xFF);
	GT32L32_SendByte((Address>>8)		&	0xFF);
	GT32L32_SendByte(Address				&	0xFF);
	if((Address&0x0B000000)==0x0B000000)
		GT32L32_SendByte(0XFF);							//从字库读出点阵数据到数组中。
	//____________接收数据	
	for(j=0;j<len;j++)
	{
	 Buffer[j]=GT32L32_ReadByte();	// 从字库读出点阵数据到数组中。
	}
	//____________取消片选
	GT32L32_CS_DisSelect;
	return Buffer[0];
#endif
}

//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	GT32_ReadWriteByte
//->功能描述		:	读写一个字节
//->输入			: 写入一个字节
//->输出			:	读出的字节
//->返回值			:	无
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
u8	GT32L32_ReadWriteByte(u8 Data)
{
#ifdef	GT32L32_SPIPORT_EN		//使用SPI接口
	//____________定义变量
	u16 retry=0XFFFF;													//用来进行超时计数
	//____________等待发送缓冲区为空
	while (SPI_I2S_GetFlagStatus(GT32L32_SPI_PORT, SPI_I2S_FLAG_BSY) == SET);	
//	while(SPI_I2S_GetFlagStatus(GT32L32_SPI_PORT, SPI_I2S_FLAG_TXE) == RESET); 		//检查指令SPI发送标志是否为空
//	{
//		retry++;
//		if(retry>2000)
//			return 0;
//	}	
	//____________发送数据
	SPI_I2S_SendData(GT32L32_SPI_PORT, Data);				//发送数据
	//____________等待接收数据
//	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY) == SET);
	retry=0;	
//	while(SPI_I2S_GetFlagStatus(GT32L32_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)		//检查指令SPI接收完成标志设置与否
//	{
//		retry++;
//		if(retry>8000)
//			return 0;
//	}
	while (SPI_I2S_GetFlagStatus(GT32L32_SPI_PORT, SPI_I2S_FLAG_BSY) == SET);
	//____________返回接收到的数据
	return SPI_I2S_ReceiveData(GT32L32_SPI_PORT); 			//返回接收到的数据	
#else					//使用自定义协议
	u8	dat=0;
	dat=GT32L32_ReadByte();	
	return dat;
#endif
}

//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	GT32L32_SendByte
//->功能描述		:	发送一个字节数据,先发送高位
//->输入			: 
//->输出			:	
//->返回值			:	
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
void GT32L32_SendByte(u8 ByteData)
{
	u8 i;
	for(i=0;i<8;i++)
	{
		GT32L32_CLK_L;
		if(ByteData&0x80)
			GT32L32_SI_H;
		else 
			GT32L32_SI_L;
		GT32L32_CLK_H;
		ByteData=ByteData<<1;
	}					
}
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
//->函数名			:	ReadByte
//->功能描述		:	读一个字节,先读高位
//->输入			: 	
//->输出			:		
//->返回值			:		
//->例程			:
//->调用函数		:
//->被调用函数	:
//<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=<=
u8 GT32L32_ReadByte(void)
{
	u8 i;
	u8 dat=0;
	GT32L32_CLK_H;
	for(i=0;i<8;i++)
	{
		GT32L32_CLK_L;
		dat=dat<<1;
		if(GT32L32_SO)
			dat=dat|0x01;
		else 
			dat&=0xfe;
		GT32L32_CLK_H	;		
	}	
	return dat;
}


/*******************	wegam@sina.com	*******************/
/*********************	2017/01/21	*********************/
/**********************	END OF FILE	*********************/



